Ran Plan for 3 projects:

1. dir: `src/backend` workspace: `default`
1. dir: `src/service_acc` workspace: `default`
1. dir: `src/terraform` workspace: `default`
---

### 1. dir: `src/backend` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.backend will be created
+ resource "local_file" "backend" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../terraform/secret.backend.tfvars"
      + id                   = (known after apply)
    }

  # yandex_iam_service_account.sa will be created
+ resource "yandex_iam_service_account" "sa" {
      + created_at         = (known after apply)
      + description        = (known after apply)
      + folder_id          = (known after apply)
      + id                 = (known after apply)
      + labels             = (known after apply)
      + name               = "sa-bucket"
      + service_account_id = (known after apply)
    }

  # yandex_iam_service_account_static_access_key.sa-static-key will be created
+ resource "yandex_iam_service_account_static_access_key" "sa-static-key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.sa-editor will be created
+ resource "yandex_resourcemanager_folder_iam_member" "sa-editor" {
      + folder_id = "b1gpmvq18drtrb8dtdim"
      + member    = (known after apply)
      + role      = "storage.editor"
    }

  # yandex_storage_bucket.tfstate will be created
+ resource "yandex_storage_bucket" "tfstate" {
      + access_key            = (known after apply)
      + acl                   = (known after apply)
      + bucket                = "diplom-osipenkov"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = true
      + id                    = (known after apply)
      + policy                = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + grant (known after apply)

      + versioning (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ access_key           = (sensitive value)
+ bucket_name          = "diplom-osipenkov"
+ secret_key           = (sensitive value)
+ service_account_name = "sa-bucket"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d src/backend
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-86f6d945cb-2b2dz:4141/lock?id=Kovrei%252Fnetology_diplom%252Fsrc%252Fbackend%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d src/backend
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 2. dir: `src/service_acc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_iam_service_account.ig-sa will be created
+ resource "yandex_iam_service_account" "ig-sa" {
      + created_at         = (known after apply)
      + description        = "Сервисный аккаунт для управления группой ВМ."
      + folder_id          = (known after apply)
      + id                 = (known after apply)
      + labels             = (known after apply)
      + name               = "sa-ig"
      + service_account_id = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.compute_admin will be created
+ resource "yandex_resourcemanager_folder_iam_member" "compute_admin" {
      + folder_id = (sensitive value)
      + member    = (known after apply)
      + role      = "admin"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ service_account_name_ig = "sa-ig"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d src/service_acc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-86f6d945cb-2b2dz:4141/lock?id=Kovrei%252Fnetology_diplom%252Fsrc%252Fservice_acc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d src/service_acc
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `src/terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false -upgrade' in '/home/atlantis/.atlantis/repos/Kovrei/netology_diplom/9/default/src/terraform': exit status 1
Initializing the backend...
╷
│ Error: Missing Required Value
│ 
│   on provider.tf line 9, in terraform:
│    9:   backend "s3" {
│ 
│ The attribute "bucket" is required by the backend.
│ 
│ Refer to the backend documentation for additional information which
│ attributes are required.
╵

```
</details>

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```